cases/test/0/N
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      N;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [-1 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet				
    {
        type            inletOutlet;
	inletValue	uniform 0;
        value           $internalField;
    }
    outerwall				
    {
        type            zeroGradient;
    }
    longitudinal_symmetry
    {
        type            symmetryPlane;
    }
    lateral_sides
    {
        type            empty;
    }
}

// ************************************************************************* //
